data_loader/logs/HotelDebugMessages.log

------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Header>
  <CallOptions xmlns="urn:partner.soap.sforce.com">
   <client>DataLoaderPartnerBatch/42.0</client>
   <defaultNamespace xsi:nil="true" />
  </CallOptions>
 </env:Header>
 <env:Body>
  <m:login xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com">
   <m:username>test-fzoc3xeotebv@example.com</m:username>
   <m:password>G_@1s059oq4xB7JWzHiTuc41u1PSnWF2pHB</m:password>
  </m:login>
 </env:Body>
</env:Envelope>
------------ Request end   ----------
------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Header>
  <CallOptions xmlns="urn:partner.soap.sforce.com">
   <client>DataLoaderPartnerBatch/42.0</client>
   <defaultNamespace xsi:nil="true" />
  </CallOptions>
  <SessionHeader xmlns="urn:partner.soap.sforce.com">
   <sessionId>00D4E0000009abN!ARMAQGXcPpRERt6I4kKPsg3Fb5_v_dfA.2taUL.Qa4s4BXZPMH6SZ5DDekVHzbGCnDv7BXnmUGlrQoOqTOK66H_zwrNyttu9</sessionId>
  </SessionHeader>
 </env:Header>
 <env:Body>
  <m:describeSObject xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com">
   <m:sObjectType>Hotel__c</m:sObjectType>
  </m:describeSObject>
 </env:Body>
</env:Envelope>
------------ Request end   ----------
------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Header>
  <CallOptions xmlns="urn:partner.soap.sforce.com">
   <client>DataLoaderPartnerBatch/42.0</client>
   <defaultNamespace xsi:nil="true" />
  </CallOptions>
  <SessionHeader xmlns="urn:partner.soap.sforce.com">
   <sessionId>00D4E0000009abN!ARMAQGXcPpRERt6I4kKPsg3Fb5_v_dfA.2taUL.Qa4s4BXZPMH6SZ5DDekVHzbGCnDv7BXnmUGlrQoOqTOK66H_zwrNyttu9</sessionId>
  </SessionHeader>
 </env:Header>
 <env:Body>
  <m:describeGlobal xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com" />
 </env:Body>
</env:Envelope>
------------ Request end   ----------
------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Header>
  <CallOptions xmlns="urn:partner.soap.sforce.com">
   <client>DataLoaderPartnerBatch/42.0</client>
   <defaultNamespace xsi:nil="true" />
  </CallOptions>
  <AllowFieldTruncationHeader xmlns="urn:partner.soap.sforce.com">
   <allowFieldTruncation>true</allowFieldTruncation>
  </AllowFieldTruncationHeader>
  <DisableFeedTrackingHeader xmlns="urn:partner.soap.sforce.com">
   <disableFeedTracking>true</disableFeedTracking>
  </DisableFeedTrackingHeader>
  <SessionHeader xmlns="urn:partner.soap.sforce.com">
   <sessionId>00D4E0000009abN!ARMAQGXcPpRERt6I4kKPsg3Fb5_v_dfA.2taUL.Qa4s4BXZPMH6SZ5DDekVHzbGCnDv7BXnmUGlrQoOqTOK66H_zwrNyttu9</sessionId>
  </SessionHeader>
 </env:Header>
 <env:Body>
  <m:upsert xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com">
   <m:externalIDFieldName>ExternalId__c</m:externalIDFieldName>
   <m:sObjects>
    <sobj:type xsi:type="xsd:string">Hotel__c</sobj:type>
    <sobj:Geo__Longitude__s xsi:type="xsd:string">-71.068824</sobj:Geo__Longitude__s>
    <sobj:Geo__Latitude__s xsi:type="xsd:string">42.360418</sobj:Geo__Latitude__s>
    <sobj:Name xsi:type="xsd:string">TsmarT Boston Grove</sobj:Name>
    <sobj:Address__c xsi:type="xsd:string">17 Grove Street, Boston, MA 02114-3203, United States of America</sobj:Address__c>
    <sobj:ExternalId__c xsi:type="xsd:string">1</sobj:ExternalId__c>
   </m:sObjects>
   <m:sObjects>
    <sobj:type xsi:type="xsd:string">Hotel__c</sobj:type>
    <sobj:Geo__Longitude__s xsi:type="xsd:string">-71.039819</sobj:Geo__Longitude__s>
    <sobj:Geo__Latitude__s xsi:type="xsd:string">42.333828</sobj:Geo__Latitude__s>
    <sobj:Name xsi:type="xsd:string">TsmarT Boston Telegraph Hill</sobj:Name>
    <sobj:Address__c xsi:type="xsd:string">517 East Fifth Street, Boston, MA 02127, United States of America</sobj:Address__c>
    <sobj:ExternalId__c xsi:type="xsd:string">2</sobj:ExternalId__c>
   </m:sObjects>
   <m:sObjects>
    <sobj:type xsi:type="xsd:string">Hotel__c</sobj:type>
    <sobj:Geo__Longitude__s xsi:type="xsd:string">-71.084054</sobj:Geo__Longitude__s>
    <sobj:Geo__Latitude__s xsi:type="xsd:string">42.366688</sobj:Geo__Latitude__s>
    <sobj:Name xsi:type="xsd:string">TsmarT Boston Kendall</sobj:Name>
    <sobj:Address__c xsi:type="xsd:string">196 Rogers Street, Cambridge, MA 02142, United States of America</sobj:Address__c>
    <sobj:ExternalId__c xsi:type="xsd:string">3</sobj:ExternalId__c>
   </m:sObjects>
   <m:sObjects>
    <sobj:type xsi:type="xsd:string">Hotel__c</sobj:type>
    <sobj:Geo__Longitude__s xsi:type="xsd:string">-71.162084</sobj:Geo__Longitude__s>
    <sobj:Geo__Latitude__s xsi:type="xsd:string">42.371419</sobj:Geo__Latitude__s>
    <sobj:Name xsi:type="xsd:string">TsmarT Boston East</sobj:Name>
    <sobj:Address__c xsi:type="xsd:string">21 Hillside Road, Watertown, MA 02478-3432, United States of America</sobj:Address__c>
    <sobj:ExternalId__c xsi:type="xsd:string">4</sobj:ExternalId__c>
   </m:sObjects>
  </m:upsert>
 </env:Body>
</env:Envelope>
------------ Request end   ----------
